#!/usr/bin/env python
# -*- coding: utf-8 -*-
#author:zhl

##完美购物车作业需求：
##需求：写一个购物小程序
# 1.用户启动时先输入工资
# 1.用户启动程序后，打印商品列表；
# 2.允许用户选择购买商品
# 3.允许用户不断的购买各种商品；
# 4.购买时，检测余额是否足够，如果够，直接扣款，否则打印“余额不足”
# 5.允许用户主动退出程序，退出是打印已够列表；


#优化需求：
# 1.优化购物程序，购买时允许用户选择购买多少件？
# 2.允许多用户登录，下一次登录后，继续上次的余额继续购买；
# 3.允许用户查看之前的购物记录（记录呀显示商品的购买时间）
# 4.商品列表分级展示，比如：
# 第一级菜单：
#   1.家电类；
#   2.衣服；
#   3.手机类
#   4.车类
# 随便选择一个，比如车类，进入第2层：
# 1.BMW  x3  33333
# 2.BMW  x2  3333
# 。。。
#
# 5.显示易购买商品时，如果有重复的商品，不打印多行，而是在一行展示，增加一个num 列及总金额；



